Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗаказПоставщику/Forms/ФормаПодбораНоменклатуры/Ext/Form/Module.bsl
&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	СтруктураВозврата = Новый Структура;
	
	МассивЗначений = Новый Массив;
	
	ЗаполнитьСтруктуруВозвратаНаСервере();
	
	Для Каждого Стр Из ПеремещаемаяНоменклатура Цикл
		
		МассивЗначений.Добавить(Стр.Номенклатура);
		
	КонецЦикла;
	
	СтруктураВозврата.Вставить("СписокНоменклатуры", МассивЗначений);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИнструментовНаСкладеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭлементВыбора = Элемент.ТекущиеДанные.Номенклатура; 
	
	Элемент.ТекущиеДанные.Выбран = Истина;
	
	ЭлементВыбран = Ложь;
	
	Для Каждого Стр Из ПеремещаемаяНоменклатура Цикл
		
		Если Стр.Номенклатура = ЭлементВыбора Тогда
			ЭлементВыбран = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЭлементВыбран Тогда
		СтрокаДоб = ПеремещаемаяНоменклатура.Добавить();
		СтрокаДоб.Номенклатура = ЭлементВыбора;
	Иначе 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элемент уже выбран!";
		Сообщение.Сообщить();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТЧПоСкладу();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НовоеУсловноеОформление = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
	НовоеУсловноеОформление.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 70));
	
	ОтборЭлемента = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокИнструментовНаСкладе.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина; 
		
	ПолеЭлемента = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокИнструментовНаСкладе");	
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТЧПоСкладу()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
		|	ЛОЖЬ КАК Выбрать,
		|	НЕОПРЕДЕЛЕНО КАК Картинка
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
		|	ВТ_Номенклатура.Выбрать КАК Выбрать,
		|	ВТ_Номенклатура.Картинка КАК Картинка,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) / ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0)
		|	КОНЕЦ КАК Себестоимость,
		|	ВТ_Номенклатура.Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки КАК ОстаткиНоменклатурыОстатки
		|		ПО ВТ_Номенклатура.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|ИТОГИ ПО
		|	Номенклатура ТОЛЬКО ИЕРАРХИЯ";
	
	ДеревоЗначений = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);    
    ЗначениеВРеквизитФормы(ДеревоЗначений, "СписокНоменклатуры");
	
	ЭлементыУдаления = Новый Массив;
	
	КоличествоВложенныхЭлементов = РекурсивнаяКорректировкаНаименований(СписокНоменклатуры.ПолучитьЭлементы(), ЭлементыУдаления);
	
	Для Каждого ИдентификаторСтроки Из ЭлементыУдаления Цикл	
		Если НЕ ИдентификаторСтроки = Неопределено Тогда		
			ТекущаяСтрока       = СписокНоменклатуры.НайтиПоИдентификатору(ИдентификаторСтроки.ПолучитьИдентификатор());
			СтрокаРодитель      = ТекущаяСтрока.ПолучитьРодителя();	
			Если СтрокаРодитель = Неопределено Тогда
				СписокНоменклатуры.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
			Иначе
				СтрокаРодитель.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	//--
	ЭлементыУдаления = Новый Массив;
	
	КоличествоВложенныхЭлементов = РекурсивнаяКорректировкаНаименований(СписокНоменклатуры.ПолучитьЭлементы(), ЭлементыУдаления);
	
	Для Каждого ИдентификаторСтроки Из ЭлементыУдаления Цикл	
		Если НЕ ИдентификаторСтроки = Неопределено Тогда		
			ТекущаяСтрока       = СписокНоменклатуры.НайтиПоИдентификатору(ИдентификаторСтроки.ПолучитьИдентификатор());
			СтрокаРодитель      = ТекущаяСтрока.ПолучитьРодителя();	
			Если СтрокаРодитель = Неопределено Тогда
				СписокНоменклатуры.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
			Иначе
				СтрокаРодитель.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПеремещаемыеИнструментыПередУдалением(Элемент, Отказ)
	
		
КонецПроцедуры

&НаСервере
Функция РекурсивнаяКорректировкаНаименований(ЭлементыДерева, ЭлементыУдаления)

	КоличествоЭлементов = 0;
	
	Для каждого Элем Из ЭлементыДерева Цикл
		
		КоличествоЭлементов = КоличествоЭлементов + 1;
		
		Если НЕ ЗначениеЗаполнено(Элем.Номенклатура) Тогда
			Элем.Номенклатура = "Без группы";
			Элем.ЭтоГруппа = Истина;
		КонецЕсли;
		
		Если Элем.ЭтоГруппа Тогда
			Элем.Картинка = БиблиотекаКартинок.Папка;
		ИначеЕсли Элем.ПометкаУдаления Тогда
			Элем.Картинка = БиблиотекаКартинок.КодМаркировкиОтсутствуетГосИС;	
		Иначе
			Элем.Картинка = БиблиотекаКартинок.МетаданныеРеквизиты;	
		КонецЕсли;
		
		КоличествоЭлементовВложеных = РекурсивнаяКорректировкаНаименований(Элем.ПолучитьЭлементы(), ЭлементыУдаления); 
		
		Если Элем.ЭтоГруппа И КоличествоЭлементовВложеных = 0 Тогда
			ЭлементыУдаления.Добавить(Элем);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КоличествоЭлементов;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	РекурсивнаяОчисткаВыбораНаСервере();		
КонецПроцедуры

&НаСервере
Процедура РекурсивнаяОчисткаВыбораНаСервере()
	
	РекурсивнаяОчисткаВыбора(СписокНоменклатуры.ПолучитьЭлементы());

КонецПроцедуры

&НаСервере
Процедура РекурсивнаяОчисткаВыбора(ЭлементыДерева)
	
	Для каждого Элем Из ЭлементыДерева Цикл		
		Элем.Выбрать = Ложь;	
		РекурсивнаяОчисткаВыбора(Элем.ПолучитьЭлементы()); 		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокИнструментовВыбратьПриИзменении(Элемент)
	
	Элем = Элементы.СписокИнструментов.ТекущиеДанные;
	
	Если Элем.ЭтоГруппа Тогда
		ВыбратьЭлементыРекурсивно(Элем.ПолучитьЭлементы(), Элем.Выбрать);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьЭлементыРекурсивноНаСервере(ЭлементыДерева, ЗначениеЭлем)
	
	ВыбратьЭлементыРекурсивно(ЭлементыДерева, ЗначениеЭлем)
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементыРекурсивно(ЭлементыДерева, ЗначениеЭлем)
	
	Для каждого Элем Из ЭлементыДерева Цикл
		Элем.Выбрать = ЗначениеЭлем;
		
		Попытка	
			Если Элем.ЭтоГруппа Тогда 
				ВыбратьЭлементыРекурсивно(Элем.ПолучитьЭлементы(), ЗначениеЭлем); 
			КонецЕсли;	
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
 КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруВозвратаНаСервере()
	ПеремещаемаяНоменклатура.Очистить();
	СохранитьЭлементыРекурсивно(СписокНоменклатуры.ПолучитьЭлементы());	 
КонецПроцедуры 

&НаСервере
Процедура СохранитьЭлементыРекурсивно(ЭлементыДерева)
	
	Для каждого Элем Из ЭлементыДерева Цикл
		
		Если Элем.Выбрать И НЕ Элем.ЭтоГруппа Тогда
			Стр = ПеремещаемаяНоменклатура.Добавить();
			Стр.Номенклатура = Элем.Номенклатура; 
		КонецЕсли;
		
		СохранитьЭлементыРекурсивно(Элем.ПолучитьЭлементы()); 
				
	КонецЦикла;
	
	
КонецПроцедуры
